Repository: AllyTechEngineering/my_right_portal
Catalog: lib/l10n/app_*.arb
Languages: es

# label_could_not_launch_consulate
source: Could not launch consulate
es: No se pudo iniciar el consulado

# label_could_not_launch_document
source: Could not launch document
es: No se pudo iniciar el documento

# label_could_not_launch_alert
source: Could not launch alert
es: No se pudo iniciar la alerta

# label_could_not_launch_contact_info
source: Could not launch contact info
es: No se pudo acceder a la información de contacto

# label_could_not_launch_emergency
source: Could not launch emergency
es: No se pudo acceder a la emergencia

# label_could_not_launch_legal
source: Could not launch legal
es: No se pudo acceder a la legal

# label_could_not_launch_map_location
source: Could not launch map location
es: No se pudo acceder a la ubicación del mapa

# label_could_not_launch_phone_number
source: Could not launch phone
es: No se pudo iniciar el teléfono

# label_imaged_saved
source: Image saved to gallery!
es: ¡Imagen guardada en la galería!

# label_saved_gallery
source: Saved to Photo Gallery
es: Guardado en la Galería de Fotos

# label_image_not_saved
source: Failed to save image
es: Error al guardar la imagen

# label_permission_denied
source: Permission denied to access gallery.
es: Permiso denegado para acceder a la galería.

# label_kyr_card
source: Know Your Rights Card
es: Tarjeta de Conoce tus Derechos

# label_save_gallery
source: Save to Photo Gallery
es: Guardar en la Galería de Fotos

# label_close_dialog
source: Close
es: Cerrar

# label_delete_contact
source: Delete Contact
es: Eliminar contacto

# label_delete_contact_message
source: Are you sure you want to delete this contact? This action cannot be undone
es: ¿Seguro que quieres eliminar este contacto? Esta acción no se puede deshacer

# label_cancel
source: Cancel
es: Cancelar

# label_delete
source: Delete
es: Eliminar

# label_find_consulate
source: Find The Nearest Consulate
es: Encuentre el consulado más cercano

# label_tap_find_consulate
source: Tap to locate your nearest consulate.
es: Toque para localizar el consulado más cercano.

# label_call_immediate_legal_help
source: Call for Immediate Legal Help
es: Solicita ayuda legal inmediata

# label_tap_call_immediate_legal_help
source: Tap to connect with a 24/7 legal support service.
es: Toca para conectarte con un servicio de asistencia legal disponible las 24 horas, los 7 días de la semana.

# label_about_privacy
source: Learn About Your Privacy
es: Infórmate sobre tu privacidad

# label_tap_about_privacy
source: Tap to see how MyRightToStay protects your data & anonymity.
es: Toca para ver cómo MyRightToStay protege tus datos y anonimato.

# drawer_home
source: Home
es: Inicio

# drawer_add_contacts
source: Add Contacts
es: Agregar Contactos

# drawer_view_contacts
source: View Contacts
es: Ver Contactos

# drawer_know_your_rights
source: Know Your Rights
es: Conozca sus Derechos

# drawer_legal_help
source: Legal Help
es: Asistencia Legal

# drawer_resources
source: Resources
es: Recursos

# drawer_jobs
source: Jobs
es: Trabajos

# drawer_settings
source: Settings
es: Configuraciones

# drawer_food
source: Food
es: Comida

# drawer_consulate
source: Consulate
es: Consulado

# drawer_benefits
source: Benefits
es: Beneficios

# drawer_travel
source: Travel
es: Viajes

# drawer_housing
source: Housing
es: Vivienda

# drawer_immigration
source: Immigration
es: Inmigración

# drawer_healthcare
source: Healthcare
es: Atención médica

# drawer_education
source: Education
es: Educación

# drawer_transportation
source: Transportation
es: Transporte

# drawer_local_deals
source: Local Deals
es: Ofertas locales

# share_app_msg
source: Check out the MyRightToStay app. Download it here: {url}
es: Consulta la aplicación MyRightToStay. Descárgala aquí: {url}

# share_app_title
source: Stay safe with the MyRightToStay app
es: Mantente seguro con la app MyRightToStay

# service_providers_loading_error
source: Error Loading Service Providers
es: Error al cargar proveedores de servicios

# service_providers_no_results
source: No Service Providers Found
es: No se encontraron proveedores de servicios

# service_providers_company_name
source: Company Name:
es: Nombre de la empresa:

# service_providers_contact_name
source: Contact Name:
es: Nombre del contacto:

# service_providers_address
source: Street Address:
es: Dirección:

# service_providers_city
source: City:
es: Ciudad:

# service_providers_state
source: State:
es: Provincia:

# service_providers_zip
source: Zip:
es: Código postal:

# service_providers_mobile_phone
source: Mobile Phone:
es: Teléfono móvil:

# service_providers_office_phone
source: Office Phone:
es: Teléfono de la oficina:

# service_providers_email
source: Email
es: Correo electrónico

# service_providers_website
source: Website
es: Sitio web

# service_enter_zip_code
source: Enter your zip code to find service providers near you.
es: Ingresa tu código postal para encontrar proveedores de servicios cerca de ti.

# service_search
source: Search
es: Buscar

# service_invalid_zip_code
source: Invalid Zip Code
es: Código postal no válido

source: Service Providers
es: Proveedores de Servicios

# service_providers_away
source: away
es: de distancia

# service_providers_state_none
source: No state selected
es: Ningún estado seleccionado

# service_providers_imageUrl
source: Enter your Image URL
es: Ingresa la URL de tu imagen

# service_providers_experience
source: Experience:
es: Experiencia:

# service_providers_languages
source: Languages:
es: Idiomas:

# service_providers_eduction
source: Education:
es: Educación:

# service_providers_specialties
source: Specialties
es: Especialidades

# service_providers_education
source: Education
es: Educación

# service_providers_consultation_fee
source: Consultation Fee
es: Tarifa de consulta

# service_providers_bio
source: Bio
es: Biografía

# service_providers_en
source: English Data Entry
es: Introducción de datos en inglés

# service_providers_es
source: Spanish Data Entry
es: Introducción de datos en español

# about_us_description
source: We create educational apps to empower learning and growth. Our goal is to make knowledge accessible, intuitive, and engaging for diverse communities. With a focus on real-world impact, we build tools that support lifelong learning and positive change.
es: Creamos aplicaciones educativas para impulsar el aprendizaje y el crecimiento. Nuestro objetivo es hacer que el conocimiento sea accesible, intuitivo y atractivo para comunidades diversas. Nos enfocamos en crear herramientas que apoyen el aprendizaje continuo y el cambio positivo.

# privacy_policy_prompt
source: Tap to view our privacy policy
es: Toca para ver nuestra política de privacidad

# label_app_version
source: App Version
es: Versión de la aplicación

# label_app_loading
source: Loading...
es: Cargando...

# label_app_name
source: Name:
es: Nombre:

# label_app_version_number
source: Version:
es: Versión:

# lable_app_build_number
source: Build Number:
es: Número de compilación:

# label_about_us
source: About Us
es: Sobre nosotros

# healthcare_rights_url
source: https://www.nilc.org/resources/health-insurance-and-care-rights/
es: https://www.nilc.org/resources/derechos-seguro-y-cuidado-de-salud/

# healthcare_url_not_found
source: URL is not available.
es: La URL no está disponible.

# healthcare_find_nearest
source: Find a Healthcare Provider
es: Buscar un profesional de la salud

# healthcare_find_clinic
source: Find a Free or Charitable Clinic
es: Buscar una clínica gratuita o benéfica

# country_usa
source: United States
es: Estados Unidos

# country_dominican_republic
source: Dominican Republic
es: República Dominicana

# country_equatorial_guinea
source: Equatorial Guinea
es: Guinea Ecuatorial

# country_mexico
source: Mexico
es: México

# country_panama
source: Panama
es: Panamá

# country_peru
source: Peru
es: Perú

# country_spain
source: Spain
es: España

# community_service_url_one
source: https://www.mlkch.org/community-resources
es: https://www.mlkch.org/es/community-resources

# community_service_url_two
source: https://www.cahealthwellness.com/members/medicaid/calaim-resources/community-supports.html
es: https://www-es.cahealthwellness.com/members/medicaid/calaim-resources/community-supports.html

# community_service_url_three
source: https://www.chpw.org/member-center/health-management/community-programs/
es: https://www.chpw.org/es/member-center/health-management/community-programs/

# community_service_url_six
source: https://fsacares.org/lhp-family-support-services/
es: https://es.fsacares.org/lhp-family-support-services/

# community_social_services
source: Community and Social Services
es: Servicios Comunitarios y Sociales

# community_social_california
source: Community and Social Services - California
es: Servicios Comunitarios y Sociales - California

# community_social_washington
source: Community and Social Services - Washington
es: Servicios Comunitarios y Sociales - Washington

# community_social_ohio
source: Community and Social Services - Ohio
es: Servicios Comunitarios y Sociales - Ohio

# community_social_spanish_community
source: Community and Social Services - Spanish Community
es: Servicios Comunitarios y Sociales - Comunidad Hispana

# community_social_family_support
source: Community and Social Services - Family Support
es: Servicios Sociales y Comunitarios - Apoyo Familiar

# view_service_providers_search
source: Search for Attorneys
es: Buscar abogados

# view_service_provider_legal_title
source: Get Legal Help Now - Free & Paid Options Available
es: Obtenga ayuda legal ahora - Opciones gratuitas y de pago disponibles

# view_service_provider_legal_subtitle
source: Find trusted immigration attorneys, connect with free legal services, or get emergency legal support right now.
es: Encuentre abogados de inmigración de confianza, conéctese con servicios legales gratuitos o reciba asistencia legal de emergencia ahora mismo.

# view_service_provider_legal_services
source: Legal Services
es: Servicios Legales

# view_service_provider_ask_lawyer
source: Ask a Lawyer On Call
es: Consulte con un abogado de guardia

# view_service_provider_ask_lawyer_subtitle
source: Get immediate legal advice from immigration attorneys available now. Affordable consultations to address your specific questions and concerns.
es: Obtenga asesoría legal inmediata de abogados de inmigración disponibles ahora. Consultas asequibles para abordar sus preguntas e inquietudes específicas.

# view_service_provider_immediate_legal_help_title
source: Get Immediate Legal Help
es: Obtenga ayuda legal inmediata

# view_service_provider_immediate_legal_help_subtitle
source: Access dedicated immigration attorneys 24/7, starting at $29.95 a month. Get your consultation today and protect your rights.
es: Acceda a abogados de inmigración dedicados las 24 horas, los 7 días de la semana, desde $29.95 al mes. Solicite su consulta hoy mismo y proteja sus derechos.

# view_service_provider_immediate_legal_help_button
source: Get Started Now
es: Empiece ahora

# service_providers_sort_by
source: Sort By
es: Ordenar por

# service_providers_sort_distance
source: Distance
es: Distancia

# service_providers_sort_radius
source: Search by Radius
es: Buscar por radio

# service_providers_sort_city
source: City
es: Ciudad

# service_providers_sort_state
source: State
es: Estado

# service_providers_sort_zip
source: Zip Code
es: Código postal

# service_invalid_radius
source: Invalid Radius
es: Radio inválido

# service_providers_city_optional
source: City (optional)
es: Ciudad (opcional)

# service_providers_state_optional
source: State (optional)
es: Estado (opcional)

# service_providers_distance
source: miles away
es: millas de distancia

# service_providers_years_of_experience
source: years of experience
es: años de experiencia

# kyr_in_your_home_url
source: https://www.informedimmigrant.com/resources/detention-deportation/know-your-rights/#rights-inside-your-home
es: https://www.inmigranteinformado.com/recursos/conozca-sus-derechos/conozca-sus-derechos/#sus-derechos-dentro-de-su-casa

# kyr_outside_your_home_url
source: https://www.informedimmigrant.com/resources/detention-deportation/know-your-rights/#your-rights-outside-your-home
es: https://www.inmigranteinformado.com/recursos/conozca-sus-derechos/conozca-sus-derechos/#sus-derechos-fuera-de-su-casa

# kyr_in_your_home_title
source: In Your Home
es: En tu casa

# kyr_outside_your_home_title
source: Outside Your Home
es: Fuera de tu casa

# kyr_news_title
source: Immigartion News
es: Noticias de Inmigración

# kyr_new_url
source: https://english.elpais.com/
es: https://elpais.com/us/?ed=us

# error_generic
source: Something went wrong. Please try again.
es: Ocurrió un error. Por favor, inténtalo de nuevo.

# error_website_unavailable
source: We apologize, this website is no longer available.
es: Lo sentimos, este sitio web ya no está disponible.

# error_email_unavailable
source: We apologize, this email link is no longer available.
es: Lo sentimos, este enlace de correo electrónico ya no está disponible.

# error_phone_unavailable
source: We apologize, this phone number is no longer available.
es: Lo sentimos, este número de teléfono ya no está disponible.

# error_phone_number_invalid
source: We apologize, this phone number is invalid.
es: Lo sentimos, este número de teléfono no es válido.

# error_email_invalid
source: We apologize, this email address is invalid.
es: Lo sentimos, esta dirección de correo electrónico no es válida.

# send_emergency_message_tap
source: Tap to create your text message.
es: Toca para crear tu mensaje de texto.

# send_emergency_message_sent
source: Your emergency message has been sent!
es: ¡Tu mensaje de emergencia ha sido enviado!

# send_emergency_message_error
source: Error sending emergency message. Please try again.
es: Error al enviar el mensaje de emergencia. Inténtalo de nuevo.

# send_emergency_message_title
source: Send Emergency Messages
es: Enviar mensajes de emergencia

# send_emergency_message_subtitle
source: On iPhones, Apple requires you to send each emergency message individually—so you'll need to tap send for each contact.
es: En los iPhone, Apple requiere que envíes cada mensaje de emergencia individualmente, por lo que tendrás que pulsar "Enviar" para cada contacto.

# privacy_statement_title
source: Privacy Statement
es: Declaración de privacidad

# privacy_statement_content
source: This app does not collect, store, or share any personal information. All data remains on your device and is used solely for the purpose of providing app functionality. No user data is transmitted to external servers.
es: Esta aplicación no recopila, almacena ni comparte información personal. Todos los datos permanecen en su dispositivo y se utilizan únicamente para brindar la funcionalidad de la aplicación. Ningún dato del usuario se transmite a servidores externos.

# app_store_badge_image
source: assets/images/app_store_badge_en.png
es: assets/images/app_store_badge_es.png

# play_store_badge_image
source: assets/images/google_play_store_badge_en.png
es: assets/images/google_play_store_badge_es.png

# download_app_message
source: Download the My Right To Stay app for free on the App Store or Google Play
es: Descarga la app "Mi Derecho a Quedarse" gratis en la App Store o Google Play

# app_coming_soon
source: The Android App is Coming Soon!
es: ¡La app para Android estará disponible próximamente!

# app_coming_soon_subtitle
source: The Android version of the app is coming in a few weeks. Stay tuned for updates!
es: La versión para Android de la app estará disponible en unas semanas. ¡Estén atentos a las actualizaciones!

# attorney_only
source: Attorneys Only
es: Solo Abogados

# attorney_login_register
source: Attorneys: Login or Register
es: Abogados: Iniciar Sesión o Registrarse

# website
source: This Website is Under Construction
es: Este sitio web está en construcción

# data_entry_video_con
source: Video Consultation
es: Videoconsulta

# validation_phone_required
source: Phone number is required.
es: Se requiere el número de teléfono.

# validation_phone_format
source: Enter phone number as 1234567891.
es: Ingrese el número como 1234567891.

# validation_invalid_phone
source: Invalid phone number format.
es: Formato de número de teléfono inválido.

# validation_email_required
source: Email address is required.
es: Se requiere la dirección de correo electrónico.

# validation_email_invalid
source: Enter a valid email address.
es: Ingrese una dirección de correo válida.

# validation_invalid_email
source: Invalid email format.
es: Formato de correo electrónico inválido.

# validation_url_invalid
source: Enter a valid website URL.
es: Ingrese una URL de sitio web válida.

# validation_invalid_url
source: Invalid URL format.
es: Formato de URL inválido.

# validation_experience_number
source: Experience must be a number.
es: La experiencia debe ser un número.

# validation_invalid_experience
source: Invalid number format.
es: Formato de número inválido.

# validation_bio_limit
source: Bio must be 250 characters or fewer.
es: La biografía debe tener 250 caracteres o menos.

# validation_zip_format
source: ZIP Code must be exactly 5 digits.
es: El código postal debe tener exactamente 5 dígitos.

# validation_invalid_zip
source: Invalid ZIP Code format.
es: Formato de código postal no válido.

# unsaved_changes_title
source: Unsaved Changes
es: Cambios no guardados

# unsaved_changes_message
source: You have unsaved changes. Are you sure you want to leave this page?
es: Tienes cambios no guardados. ¿Estás seguro de que quieres salir de esta página?

# unsaved_changes_stay
source: Stay
es: Permanecer

# unsaved_changes_leave
source: Leave
es: Salir

source: Cancel
es: Cancelar

source: Discard
es: Descartar

# data_screen_save_warning_title
source: Do not navigate away from this screen without saving your changes.
es: No abandone esta pantalla sin guardar los cambios.

# dashboard_title
source: My Right To Stay Dashboard
es: Mi panel de control de derecho a permanecer

# dashboard_subtitle
source: Your personalized dashboard for managing your account.
es: Tu panel de control personalizado para administrar tu cuenta.

# dashboard_log_out
source: Log Out
es: Cerrar sesión

# dashboard_manage_data
source: Manage Your Data
es: Administra tus datos

# data_entry_upload_image
source: Upload Image
es: Subir imagen
