Repository: AllyTechEngineering/my_right_portal
Catalog: lib/l10n/app_*.arb
Languages: es

# kyr_work_emp_content
source: For example: Employers cannot threaten to call ICE because you and your co-workers tried to join a union. Employers cannot demand that you produce new immigration papers because you talked with your co-workers or a union about your working conditions.
es: Por ejemplo: Los empleadores no pueden amenazar con llamar a ICE porque usted y sus compañeros intentaron unirse a un sindicato. Los empleadores no pueden exigirle que presente nuevos documentos de inmigración porque habló con sus compañeros de trabajo o con un sindicato sobre sus condiciones laborales.

# kyr_work_invest_menu
source: Right to a NLRB Investigation
es: Derecho a una Investigación del NLRB

# kyr_work_invest_title
source: If you believe that your employer has retaliated against you, your coworkers or your union, you can contact the National Labor Relations Board (NLRB) to file a charge. The NLRB will investigate the charge, which includes:
es: Si cree que su empleador ha tomado represalias en su contra, contra sus compañeros de trabajo o contra su sindicato, puede comunicarse con la Junta Nacional de Relaciones Laborales (NLRB) para presentar una denuncia. La NLRB investigará el caso, lo que incluye:

# kyr_work_invest_content
source: •Taking your affidavit and asking for your evidence. •Because you are protected under the NLRA just the same as any other worker and because an individual's immigration status is not relevant to whether the NLRA has been violated, the NLRB will not ask about your immigration status or the immigration status of others during our investigation or litigation to prove violations of the NLRA. •The NLRB may take legal action against your employer if the evidence shows that your employer is unlawfully using your immigration status to threaten or retaliate against you because you exercised your rights under the NLRA. •The NLRB may also work with other agencies to ensure that immigration laws are not being used to threaten or retaliate against workers for exercising their rights under the NLRA. •If your employer has fired you because you exercised your rights under the NLRA, the NLRB will work to get your job back and to get you paid for your lost wages. •But if the employer proves that you were not authorized to work, the NLRB cannot order the employer to pay you lost wages and may not be able to get you your job back. •In those situations, the NLRB will seek other remedies and may work with immigration agencies to assist with employees who have been victims of labor rights violations. •For example, the NLRB may consider whether you could be eligible for a U or T visa or deferred action and may work with immigration agencies to try and obtain this kind of relief.
es: Tomar su declaración y solicitar sus pruebas. Debido a que está protegido bajo la Ley Nacional de Relaciones Laborales (NLRA) de la misma manera que cualquier otro trabajador, y porque el estatus migratorio de una persona no es relevante para determinar si la NLRA ha sido violada, la Junta Nacional de Relaciones Laborales (NLRB) no preguntará sobre su estatus migratorio ni el de otras personas durante nuestra investigación o litigio para demostrar violaciones de la NLRA. La NLRB puede tomar acciones legales contra su empleador si las pruebas demuestran que su empleador está utilizando ilegalmente su estatus migratorio para amenazarlo o tomar represalias en su contra por haber ejercido sus derechos bajo la NLRA. La NLRB también puede trabajar con otras agencias para garantizar que las leyes de inmigración no se utilicen para amenazar o tomar represalias contra los trabajadores que ejercen sus derechos bajo la NLRA. Si su empleador lo despidió porque ejerció sus derechos bajo la NLRA, la NLRB trabajará para que recupere su empleo y reciba el pago de los salarios perdidos. Sin embargo, si el empleador demuestra que usted no estaba autorizado para trabajar, la NLRB no podrá ordenar que le paguen los salarios perdidos ni garantizar la restitución de su empleo. En tales casos, la NLRB buscará otras soluciones y podrá trabajar con agencias de inmigración para ayudar a empleados que hayan sido víctimas de violaciones a sus derechos laborales. Por ejemplo, la NLRB puede considerar si usted es elegible para una visa U o T o para un proceso de acción diferida, y puede colaborar con agencias de inmigración para ayudarle a obtener este tipo de alivio.

# kyr_work_pay_menu
source: Right to Be Paid Fairly
es: Derecho a un Pago Justo

# kyr_work_pay_title
source: The Fair Labor Standards Act (FLSA) prohibits employers from discriminating against workers on the basis of their immigration status.
es: La Ley de Normas Laborales Justas (FLSA) prohíbe a los empleadores discriminar a los trabajadores por su estatus migratorio.

# kyr_work_pay_content
source: The Fair Labor Standards Act (FLSA) prohibits employers from discriminating against workers on the basis of their immigration status, meaning undocumented immigrants have the right to be paid the same wages for the same work as U.S. citizens and legal residents. Additionally, undocumented immigrants are entitled to overtime pay, minimum wage, and the same safety and health protections as other workers.
es: La Ley de Normas Laborales Justas (FLSA) prohíbe a los empleadores discriminar a los trabajadores por su estatus migratorio, lo que significa que los inmigrantes indocumentados tienen derecho a recibir el mismo salario por el mismo trabajo que los ciudadanos estadounidenses y los residentes legales. Además, los inmigrantes indocumentados tienen derecho al pago de horas extras, al salario mínimo y a las mismas protecciones de seguridad y salud que los demás trabajadores.

# kyr_work_safe_menu
source: Right to a Safe Work Environment
es: Derecho a un Ambiente de Trabajo Seguro

# kyr_work_safe_title
source: The Occupational Safety and Health Act (OSHA) requires employers to provide a safe and healthy work environment for all of their employees.
es: La Ley de Seguridad y Salud Ocupacional (OSHA) exige que los empleadores proporcionen un ambiente de trabajo seguro y saludable para todos sus empleados.

# kyr_work_safe_content
source: The Occupational Safety and Health Act (OSHA) requires employers to provide a safe and healthy work environment for all of their employees, regardless of their legal status. Consequently, even undocumented immigrants have the right to report workplace hazards and discrimination without fear of retaliation. Furthermore, employers are prohibited from retaliating against undocumented immigrants who file OSHA complaints.
es: La Ley de Seguridad y Salud Ocupacional (OSHA) exige que los empleadores proporcionen un ambiente de trabajo seguro y saludable para todos sus empleados, independientemente de su estatus legal. En consecuencia, incluso los inmigrantes indocumentados tienen derecho a denunciar peligros en el lugar de trabajo y discriminación sin temor a represalias. Además, se prohíbe a los empleadores tomar represalias contra inmigrantes indocumentados que presenten quejas ante OSHA.

# kyr_work_discrim_menu
source: Right Against Discrimination
es: Derecho Contra la Discriminación

# kyr_work_discrim_title
source: Title VII of the Civil Rights Act also protects undocumented immigrants against employment discrimination.
es: El Título VII de la Ley de Derechos Civiles también protege a los inmigrantes indocumentados contra la discriminación laboral.

# kyr_work_discrim_content
source: Title VII of the Civil Rights Act also protects undocumented immigrants against employment discrimination based on race, color, religion, sex, or national origin, further ensuring a fair and secure workplace.
es: El Título VII de la Ley de Derechos Civiles también protege a los inmigrantes indocumentados contra la discriminación laboral basada en raza, color, religión, sexo u origen nacional, garantizando así un entorno justo y seguro.

# kyr_work_family_menu
source: Right to Be with Family
es: Derecho a Estar con la Familia

# kyr_work_family_title
source: The right to family unity is articulated in the Universal Declaration of Human Rights.
es: El derecho a la unidad familiar está establecido en la Declaración Universal de Derechos Humanos.

# kyr_work_family_content
source: The right to family unity is articulated in the Universal Declaration of Human Rights (UDHR) and is particularly relevant in cases where the deportation of one parent would result in the separation of their children. However, this right isn’t absolute and is often weighed against the government's interest in enforcing immigration laws. The tradeoff between family rights and immigration control can be complex and challenging, potentially leading to family separations and emotional hardship for undocumented immigrants and their loved ones.
es: El derecho a la unidad familiar está reconocido en la Declaración Universal de los Derechos Humanos (DUDH) y es especialmente relevante en casos donde la deportación de uno de los padres resultaría en la separación de sus hijos. Sin embargo, este derecho no es absoluto y a menudo se contrapone con el interés del gobierno en hacer cumplir las leyes de inmigración. El equilibrio entre los derechos familiares y el control migratorio puede ser complejo y desafiante, lo que potencialmente conduce a separaciones familiares y dificultades emocionales para los inmigrantes indocumentados y sus seres queridos.

# kyr_work_education_menu
source: Right to Education
es: Derecho a la Educación

# kyr_work_education_title
source: Undocumented children have the right to access public education from kindergarten through 12th grade.
es: Los niños indocumentados tienen derecho a acceder a la educación pública desde el jardín de infancia hasta el grado 12.

# kyr_work_education_content
source: Under the landmark decision Plyler v. Doe (1982), undocumented children have the right to access public education from kindergarten through 12th grade, based on the Fourteenth Amendment’s Equal Protection Clause. States cannot deny free public education based on immigration status, although undocumented students may face other barriers, such as language challenges or fear of deportation.
es: Bajo la histórica decisión Plyler v. Doe (1982), los niños indocumentados tienen derecho a acceder a la educación pública desde el jardín de infancia hasta el grado 12, basado en la Cláusula de Igual Protección de la Decimocuarta Enmienda. Los estados no pueden negar la educación pública gratuita por el estatus migratorio, aunque los estudiantes indocumentados pueden enfrentar otras barreras, como dificultades con el idioma o temor a la deportación.

# kyr_work_barrier_menu
source: Barriers to Accessing Rights
es: Barreras para Acceder a los Derechos

# kyr_work_barrier_title
source: The role of public opinion and political discourse in influencing anti-immigrant sentiment cannot be overstated.
es: El papel de la opinión pública y el discurso político en la influencia del sentimiento antiinmigrante no debe subestimarse.

# kyr_work_barrier_content
source: The role of public opinion and political discourse in influencing anti-immigrant sentiment cannot be overstated. Such feelings directly and significantly impact policy formulation and the enforcement of individual rights. In societies where negative perceptions of immigrants prevail (often driven by political rhetoric and media portrayal), there’s a tendency for stricter immigration laws and policies. Environments of this sort can lead to increased difficulties for immigrants in accessing their legal rights, receiving fair treatment in judicial proceedings, and facing societal discrimination.
es: El papel de la opinión pública y el discurso político en la influencia del sentimiento antiinmigrante no debe subestimarse. Estos sentimientos impactan directa y significativamente la formulación de políticas y la aplicación de los derechos individuales. En sociedades donde prevalecen percepciones negativas sobre los inmigrantes (a menudo impulsadas por la retórica política y la representación en los medios), existe una tendencia a implementar leyes y políticas migratorias más estrictas. Entornos de este tipo pueden generar mayores dificultades para que los inmigrantes accedan a sus derechos legales, reciban un trato justo en los procedimientos judiciales y enfrenten discriminación social.

# my_right_to_stay_title
source: My Right To Stay
es: Mi Derecho A Quedar Me

# kyr_home_screen_title
source: Know your rights. Explore your options. One touch, instant protection.
es: Conozca sus derechos. Explore sus opciones. Un toque, protección instantánea.

# do_not_deport_me_title
source: DON'T DEPORT ME
es: ¡NO ME DEPORTEN!

# mrts_home_screen_safe_title
source: Stay Safe. Stay Informed. Get Help When You Need It.
es: Mantente seguro Mantente informado Reciba ayuda cuando la necesite.

# mrts_home_screen_title
source: MyRightToStay is a vital resource for immigrants, providing instant access to legal resources, emergency contacts, and local support—all 100% private and secure.
es: MyRightToStay es un recurso vital para inmigrantes, que proporciona acceso instantáneo a recursos legales, contactos de emergencia y apoyo local, todo 100% privado y seguro.

# mrts_home_screen_content_1
source: You Are Already Started. No Signup, No Fees, No Information Tracking.
es: Ya has empezado. Sin registro, sin cuotas, sin seguimiento de información.

# mrts_home_screen_content_2
source: You
es: No

# mrts_home_screen_content_3
source: don't need to create an account
es: necesitas crear una cuenta

# mrts_home_screen_content_4
source: to start using MyRightToStay. Just choose where you want to go next:
es: para empezar a usar MyRightToStay. Simplemente elige adónde quieres ir:

# mrts_home_screen_content_5
source: How It Works - Stay Safe. Stay Informed. Stay in Control.
es: Cómo funciona: Manténgase seguro. Manténgase informado. Manténgase en control.

# mrts_home_screen_content_6
source: MyRightToStay gives you instant access to emergency alerts, legal resources, and consular support—without tracking, fees, or sign-ups. Here's how you can use it to protect yourself.
es: MyRightToStay te da acceso instantáneo a alertas de emergencia, recursos legales y asistencia consular, sin seguimiento, tarifas ni registros. Descubre cómo puedes usarlo para protegerte.

# mrts_home_screen_consular_1
source: Contact Your Consular Office - Why It's Important
es: Contacte a su Oficina Consular: Por Qué es Importante

# mrts_home_screen_consular_2
source: If detained, you have the right to contact your consular office. They can provide legal support, notify your family, and advocate for fair treatment. Your consulate may help prevent deportation, ensure proper legal procedures, and connect you with an attorney.
es: Si lo detienen, tiene derecho a contactar a su oficina consular. Ellos pueden brindarle apoyo legal, notificar a su familia y abogar por un trato justo. Su consulado puede ayudarle a prevenir la deportación, garantizar los procedimientos legales adecuados y ponerlo en contacto con un abogado.

# mrts_home_screen_consular_3
source: Find My Nearest Consulate
es: Encuentra Mi Consulado Más Cercano

# mrts_home_screen_consular_url
source: https://www.gob.mx/sre/documentos/list-of-mexican-consulates-in-the-united-states?idiom=en
es: https://www.gob.mx/sre/documentos/list-of-mexican-consulates-in-the-united-states?idiom=es

# emergency_lifeline_content_1
source: 'Don't Deport Me'
es: 'No Me Deporten'

# emergency_lifeline_content_2
source: - Your Emergency Lifeline
es: - Su Línea de Vida de Emergencia

# emergency_lifeline_content_3
source: One tap alerts your emergency contacts and consular office that you are in danger or being detained. Your location is included for immediate response.
es: Con un solo toque, avisa a tus contactos de emergencia y a la oficina consular que estás en peligro o detenido. Tu ubicación se incluye para una respuesta inmediata.

# emergency_lifeline_content_4
source: Set Up
es: Configuración

# emergency_lifeline_content_5
source: Set Up Emergency Alerts
es: Configurar Alertas de Emergencia

# kyr_view_your_rights_label
source: View Your Rights Now
es: Consulta tus derechos ahora

# kyr_card_content_1
source: Know Your Rights
es: Conozca Sus Derechos

# kyr_card_content_1a
source: - Even Without Internet
es: - Incluso Sin Internet

# kyr_card_content_2
source: Access clear legal information anytime so you know exactly what to do if questioned by authorities.
es: Acceda a información legal clara en cualquier momento para saber exactamente qué hacer si las autoridades le interrogan.

# kyr_card_content_3
source: Download a Printable Rights Card
es: Descargar una Tarjeta de Derechos Imprimible

# kyr_tap_to_access
source: Tap to access a printable Know Your Rights card.
es: Toca para acceder a una tarjeta imprimible de Conoce tus Derechos.

# live_support_content_1
source: Get 24/7 Live Support
es: Obtenga Soporte en Vivo 24/7

# live_support_content_2
source: Connect with legal experts at CIAM for emergency immigration support.
es: Conéctese con expertos legales del CIAM para obtener apoyo migratorio de emergencia.

# live_support_content_3
source: Call For Immediate Help
es: Llamada Para Ayuda Inmediata

# private_secure_content_1
source: Stay 100% Private & Secure
es: Manténgase 100% Privado y Seguro

# private_secure_content_2
source: ‣ No personal info required—completely anonymous. ‣ No tracking, no data collection—your safety comes first. ‣ No government ties—MyRightToStay is completely independent.
es: ‣ No se requiere información personal: completamente anónimo. ‣ Sin seguimiento, sin recopilación de datos: su seguridad es lo primero. ‣ Sin vínculos con el gobierno: MyRightToStay es completamente independiente.

# private_secure_content_3
source: How We Protect Your Privacy
es: Cómo Protegemos su Privacidad

# call_to_action_content_1
source: Get Started Now
es: Empieza Ahora

# call_to_action_content_2
source: Help Someone Stay Safe - Share this App
es: Ayuda a Alguien a Mantenerse a Salvo - Comparte Esta App

# add_emergency_contacts_label
source: Add Emergency Contacts
es: Añadir contactos de emergencia

# add_emergency_contacts_tap_to_add
source: Tap to add trusted contacts who will be notified in case of an emergency.
es: Toca para añadir contactos de confianza que recibirán notificaciones en caso de emergencia.

# add_emergency_contacts_title
source: Set Up Your Emergency Contacts
es: Configure Sus Contactos de Emergencia

# add_emergency_view_button_title
source: View Your Contacts
es: Ver Tus Contactos

# add_emergency_contacts_subtitle_1
source: When you press the Don't 'Deport Me button', your emergency contacts will instantly receive an alert. Here, you can customize your message for each contact and attach important documents they may need to act on your behalf.
es: Al presionar el botón "No me deporte", sus contactos de emergencia recibirán una alerta al instante. Aquí puede personalizar el mensaje para cada contacto y adjuntar documentos importantes que puedan necesitar para actuar en su nombre.

# add_emergency_contacts_subtitle_2
source: • Add the people you trust to be notified in case of an emergency. • Customize your emergency message for each contact or use the default message. • Upload documents like a Power of Attorney (POA) or identification so they have what they need to help you immediately.
es: • Agrega a las personas de tu confianza para que sean notificadas en caso de una emergencia. • Personaliza tu mensaje de emergencia para cada contacto o usa el mensaje predeterminado. • Carga documentos como un poder notarial (POA) o una identificación para que tengan lo que necesitan para ayudarte de inmediato.

# add_emergency_contact_section_title
source: Contact Information
es: Información del Contacto

# add_emergency_contact_first_name
source: First Name
es: Nombre de Pila

# add_emergency_contact_last_name
source: Last Name
es: Apellido

# add_emergency_contact_name
source: Name
es: Nombre

# add_emergency_contact_phone
source: Phone Number
es: Número de Teléfono

# add_emergency_contact_email
source: Email Address (Optional)
es: Dirección de correo electrónico (opcional)

# add_emergency_contact_consulate_title
source: This is a consulate contact.
es: Este es un contacto del consulado

# add_emergency_contact_consulate_country
source: Phone Country Code
es: Código de país del teléfono

# add_emergency_contact_message_title
source: Emergency Message
es: Mensaje de Emergencia

# add_emergency_contact_message
source: I need your help immediately! I am being detained or in danger. Please follow our plan. My location is included. Contact legal help or my consular office now!
es: ¡Necesito su ayuda de inmediato! Estoy detenido o en peligro. Por favor, siga nuestro plan. Mi ubicación está incluida. ¡Contacte con asistencia legal o con mi oficina consular ahora!

# add_emergency_contact_char_cnt
source: Max 350 characters
es: Máximo 350 caracteres

# add_emergency_contact_upload_title
source: Important Documents
es: Documentos Importantes

# add_emergency_add_contact
source: Add Contact
es: Agregar Contacto

# add_emergency_contact_upload
source: Tap to take a document photo
es: Toque para tomar una foto del documento

# add_emergency_contact_upload_desc
source: ✅ Contact Added Successfully!
es: ✅ ¡Contacto añadido correctamente!

# add_emergency_contact_msg
source: Your emergency contact has been saved and will be notified immediately when you activate the "Don't Deport Me" button.
es: Tu contacto de emergencia se ha guardado y recibirás una notificación inmediata al activar el botón "No me deporten".

# add_emergency_contact_add_another
source: Add Another Contact
es: Añadir otro contacto

# add_emergency_contact_review_contacts
source: Review My Contacts
es: Revisar mis contactos

# edit_emergency_contact_return_home
source: Return to Home
es: Volver a la página principal

# edit_emergency_contact_cancel
source: Cancel
es: Cancelar

# edit_emergency_contact_add
source: Save Changes
es: Guardar Cambios

# edit_emergency_contact_title
source: Edit Contact
es: Editar Contacto

# edit_emergency_contact_success_title
source: ✅ Contact Updated Successfully!
es: ✅ ¡Contacto actualizado correctamente!

# edit_emergency_contact_success_msg
source: Your emergency contact has been updated and will be used when you activate the "Don't Deport Me" button.
es: Tu contacto de emergencia se ha actualizado y se usará al activar el botón"No me deporten".

# edit_emergency_contact_done
source: Done
es: Listo

# view_emergency_contacts_title
source: My Emergency Contacts
es: Mis Contactos de Emergencia

# view_emergency_contacts_subtitle
source: Manage your trusted contacts who will be notified in emergencies.
es: Administra tus contactos de confianza que serán notificados en caso de emergencias.

# view_emergency_contacts_add
source: Add New Contact
es: Agregar Nuevo Contacto

# view_emergency_contacts_none_found
source: No Contacts Found
es: No se Encontraron Contactos

# view_emergency_contacts_error
source: Error loading contacts
es: Error al cargar contactos

# label_additional_info
source: Additional Information
es: Información adicional

# label_could_not_launch_website
source: Could not launch website
es: No se pudo iniciar el sitio web

# label_could_not_launch_email
source: Could not launch email
es: No se pudo iniciar el correo electrónico

# label_could_not_launch_phone
source: Could not launch phone
es: No se pudo iniciar el teléfono

# label_could_not_launch_map
source: Could not launch map
es: No se pudo iniciar el mapa

# label_could_not_launch_sms
source: Could not launch SMS
es: No se pudieron iniciar los SMS

# label_could_not_launch_contact
source: Could not launch contact
es: No se pudo iniciar el contacto
