Repository: AllyTechEngineering/my_right_portal
Catalog: lib/l10n/app_*.arb
Languages: es

# disclaimer_title
source: Legal Disclaimer
es: Aviso Legal

# disclaimer_content
source: We're here to share helpful information, but this app isn't a substitute for legal advice. We don't provide legal representation, and using this app doesn't create an attorney-client relationship. If you need legal help, it's always best to talk to a licensed attorney. We hope this info is useful, but remember—every situation is different!
es: Queremos compartir información útil, pero esta app no reemplaza el asesoramiento legal. No ofrecemos representación legal y el uso de esta app no crea una relación abogado-cliente. Si necesitas ayuda legal, lo mejor es consultar con un abogado autorizado. Esperamos que esta información te sea útil, pero recuerda que cada situación es diferente.

# state_hawaii
source: Hawaii
es: Hawái

# state_louisiana
source: Louisiana
es: Luisiana

# state_missouri
source: Missouri
es: Misuri

# state_new_hampshire
source: New Hampshire
es: Nuevo Hampshire

# state_new_jersey
source: New Jersey
es: Nueva Jersey

# state_new_mexico
source: New Mexico
es: Nuevo México

# state_new_york
source: New York
es: Nueva York

# state_north_carolina
source: North Carolina
es: Carolina del Norte

# state_north_dakota
source: North Dakota
es: Dakota del Norte

# state_oregon
source: Oregon
es: Oregón

# state_pennsylvania
source: Pennsylvania
es: Pensilvania

# state_south_carolina
source: South Carolina
es: Carolina del Sur

# state_south_dakota
source: South Dakota
es: Dakota del Sur

# state_west_virginia
source: West Virginia
es: Virginia Occidental

# resources_title
source: Resources
es: Recursos

# legal_help_title
source: Legal Help
es: Ayuda Legal

# contacts_title
source: Contacts
es: Contactos

# your_rights_title
source: Your Rights
es: Tus Derechos

# find_jobs_title
source: Find Jobs
es: Buscar Empleos

# local_deals_title
source: Local Deals
es: Ofertas Locales

# home_title
source: Home
es: Inicio

# settings_title
source: Settings
es: Configuración

# menu_title
source: Menu
es: Menú

# about_us_title
source: About Us
es: Acerca de Nosotros

# provider_detail_title
source: Services
es: Servicios

# police_stops_title
source: Police Stops
es: Control Policial

# ice_raids_title
source: ICE Raids
es: Operativos de ICE

# work_rights_title
source: Work Rights
es: Derechos Laborales

# immigration_help_title
source: Immigration Help
es: Ayuda Migratoria

# healthcare_title
source: Healthcare
es: Salud

# education_title
source: Education
es: Educación

# housing_title
source: Housing
es: Vivienda

# deportation_title
source: Deportation Prep
es: Preparación para Deportación

# financial_help_title
source: Financial Help
es: Ayuda Financiera

# community_support_title
source: Community Resources
es: Apoyo Comunitario

# service_providers_title
source: Services
es: Servicios

# filter_service_type
source: Filter by Service Type
es: Filtrar por tipo de servicio

# filter_state
source: Filter by State
es: Filtrar por estado

source: No providers found
es: No se encontraron proveedores

# service_type_legal
source: Legal
es: Asistencia Legal

# service_type_food
source: Food
es: Alimentario

# service_type_consulate
source: Consulate
es: Consulado

# service_type_benefits
source: Benefits
es: Beneficios

# service_type_travel
source: Travel
es: Viajes

# service_type_housing
source: Housing
es: Vivienda

# service_type_jobs
source: Jobs
es: Empleos

# service_type_immigration
source: Immigration
es: Inmigración

# service_type_healthcare
source: Healthcare
es: Salud

# service_type_education
source: Education
es: Educación

# service_type_transportation
source: Transportation
es: Transporte

# label_type_of_business
source: Type of Business
es: Tipo de Negocio

# label_contact_name
source: Contact Name
es: Nombre de Contacto

# label_website
source: Website
es: Sitio Web

# label_address
source: Address
es: Dirección

# label_mobile_phone
source: Mobile Phone
es: Teléfono Móvil

# label_office_phone
source: Office Phone
es: Teléfono de Oficina

# label_email
source: Email
es: Correo Electrónico

# daca_advisory_text
source: This advisory is not intended as legal advice but rather to provide information on the status of the DACA program. Individuals should seek a legal consultation from a qualified immigration attorney or DOJ accredited representative for a full assessment of their individual case. Please check our website or NIJC's social media channels for future updates about DACA
es: Este aviso no es consejo legal, solo sirve para proveer información sobre actualizaciones del programa de DACA. Individuos deben buscar una consulta legal de un abogado de inmigración calificado o un representante acreditado por el DOJ para una evaluación completa de tu caso individual. Por favor revisa nuestro sitio de web o las redes sociales de NIJC para actualizaciones futuras de DACA.

# what_to_do_detained_title
source: What to do if you or a loved one is detained
es: Qué Hacer si Usted o un Ser Querido es Detenido

# immediate_steps_title
source: Immediate Steps
es: Medidas inmediatas

# a_number_section
source: Ask your friend/family member for their A-Number (A#/)
es: Pídale a su amigo/pariente su número A (A#)

# text_for_a_number_section
source: This number usually contains 9 digits. ICE will give them this number upon arrest. If your friend/family member filed a previous immigration application, it is likely they will already have an A# on any documents from immigration. If your friend/family member was arrested at the border and allowed to enter, it is likely they will already have an A# in their immigration documents.
es: Este número normalmente contiene 9 dígitos. ICE les dará este número al momento del arresto. Si su amigo/pariente presentó una solicitud de inmigración anteriormente, es probable que ya tenga un número A en algún documento de inmigración. Si su amigo/pariente fue arrestado en la frontera y se le permitió ingresar, es probable que ya tenga un número A en sus documentos de inmigración.

# detained_ice_text
source: You or Loved One Detained by ICE
es: Usted o un ser querido detenido por ICE

# detained_url_text
source: https://immigrantjustice.org/know-your-rights/what-do-if-you-or-loved-one-detained
es: https://immigrantjustice.org/es/conozca-sus-derechos/que-hacer-si-usted-o-un-ser-querido-es-detenido

# mass_deportation_text
source: Mass Deportation Threats
es: Amenazas de deportación masiva

# mass_deportation_url_text
source: https://immigrantjustice.org/know-your-rights/mass-deportation-threats
es: https://immigrantjustice.org/es/conozca-sus-derechos/las-amenazas-de-deportacion-masiva

# ice_encounter_text
source: You Or Loved One Encounter ICE
es: Usted o un ser querido se encuentra con ICE

# ice_encounter_url_text
source: https://immigrantjustice.org/know-your-rights/ice-encounter
es: https://immigrantjustice.org/es/conozca-sus-derechos/encuentro-con-ice

# immigration_scams_text
source: Avoid Immigration Scams
es: Evite estafas de inmigración

# immigration_scams_url_text
source: https://immigrantjustice.org/know-your-rights/avoid-immigration-fraud
es: https://immigrantjustice.org/es/conozca-sus-derechos/no-sea-victima-del-fraude-migratorio

# plan_deportation_text
source: Plan Ahead in the Event of Deportation
es: Planifique con anticipación en caso de deportación

# plan_deportation_url_text
source: https://immigrantjustice.org/kyr/family-protection-planning
es: https://immigrantjustice.org/es/conozca-sus-derechos/planificacion-proteccion-familiar

# parole_in_place_text
source: Parole-In-Place for Family of U.S. Citizens
es: Permiso de permanencia para familiares de ciudadanos estadounidenses

# parole_in_place_url_text
source: https://immigrantjustice.org/know-your-rights/parole-in-place-spouses-and-stepchildren
es: https://immigrantjustice.org/es/conozca-sus-derechos/libertad-condicional-para-conyuges-e-hijastros

# daca_faq_text
source: DACA FAQ
es: Preguntas frecuentes sobre DACA

# daca_faq_url_text
source: https://immigrantjustice.org/know-your-rights/deferred-action-childhood-arrivals-daca-frequently-asked-questions
es: https://immigrantjustice.org/es/know-your-rights/accion-diferida-para-los-llegados-en-infancia-daca-preguntas-frecuentes

# asylum_tps_text
source: Asylum & Temporary Protected Status
es: Asilo y Estatus de Protección Temporal

# asylum_tps_url_text
source: https://immigrantjustice.org/know-your-rights/asylum-temporary-protected-status-should-i-apply-one-or-other-or-both
es: https://immigrantjustice.org/es/know-your-rights/asilo-y-estatus-de-proteccion-temporal-debo-solicitar-uno-el-otro-u-los-dos

# u_visa_text
source: New U Visa Bona Fide Determination Procedure
es: Nuevo procedimiento de determinación de buena fe para la Visa U

# u_visa_url_text
source: https://immigrantjustice.org/know-your-rights/know-your-rights-new-u-visa-bona-fide-determination-procedure
es: https://immigrantjustice.org/es/know-your-rights/conozca-sus-derechos-el-nuevo-proceso-bona-fide

# kyr_healthcare_one_menu
source: Your Right to Health Care
es: Tu Derecho a la Atención Médica

# kyr_healthcare_two_menu
source: No ID? No Problem!
es: ¿Sin Identificación? No Hay Problema

# kyr_healthcare_three_menu
source: Your Info Stays Private
es: Tu Información es Privada

# kyr_healthcare_four_menu
source: No Need to Share Immigration Status
es: No Tienes que Compartir tu Estatus Migratorio

# kyr_healthcare_five_menu
source: SSN Not Required
es: No Necesitas un Seguro Social

# kyr_healthcare_six_menu
source: Health Services in Your Language
es: Servicios Médicos en tu Idioma

# kyr_healthcare_seven_menu
source: Health Care Options for All
es: Opciones de Atención Médica para Todos

# kyr_healthcare_title
source: Know Your Rights: Health Care & Health Insurance for Immigrants
es: Conozca Sus Derechos: Atención Médica y Seguro Médico

# kyr_healthcare_intro_content
source: Families that include people who are not authorized to be in the U.S. may have questions about whether they can safely apply for health coverage through the Affordable Care Act (ACA) Marketplaces, Medicaid, and CHIP (Children's Health Insurance Program). Some people may be worried about seeking health care because they fear that their or their family member's immigration status might be discovered or shared with immigration enforcement agents. This KYR resource provides information that all immigrant families should know when deciding to get health care or apply for health insurance programs.
es: Las familias con miembros que no están autorizados a estar en los EE. UU. pueden dudar antes de solicitar cobertura médica...

# kyr_healthcare_one_title
source: You have a right to health care regardless of your immigration status.
es: Usted tiene derecho a obtener atención médica independientemente de su estatus de inmigración.

# kyr_healthcare_one_content
source: You are not required to have U.S. citizenship, lawful immigration status, or a Social Security number (SSN) to receive health care services under federal law. Doctors, hospitals, clinics, health centers, or other medical providers may ask for this information to find out if you may be eligible for public health insurance, like Medicaid. But they cannot deny medical treatment based solely on your immigration status—or based on assumptions they make about your immigration status because of the language you speak, your accent, what you look like, or whether you have an SSN. In fact, doing so may violate federal civil rights laws. Under federal law, if you need emergency medical services, hospitals with emergency rooms must screen and treat you regardless of your immigration status, how much money you have, or whether you have insurance. Similarly, you can seek primary and preventive health care at community health centers regardless of your immigration status, your ability to pay, or whether you are insured. Some states require hospitals to ask patients about their immigration status. If you are asked for your immigration status, you do not have to provide it, and a health care provider cannot refuse to treat you because you declined to share your immigration status information.
es: Bajo la ley federal, no hace falta ser ciudadano de los EE. UU., ni tener un estatus de inmigración legal o un número del Seguro Social (SSN) para recibir servicios de atención médica. Los médicos, hospitales, clínicas, centros de salud u otros profesionales médicos pueden pedirle esta información para averiguar si usted es elegible para recibir un seguro médico público como Medicaid. Pero no pueden negarle tratamiento médico solo por su estatus de inmigración o suposiciones que hacen sobre su estatus de inmigración debido al idioma que habla, su acento, su aspecto o si tiene o no un SSN. De hecho, esto podría violar las leyes federales de derechos civiles. Bajo la ley federal, si usted necesita servicios médicos de emergencia, los hospitales con salas de emergencia están obligados a examinarlo y tratarlo sea cual sea su estatus de inmigración, la cantidad de dinero que tenga o si tiene o no un seguro médico. En forma similar, puede obtener atención médica primaria y preventiva en centros de salud comunitarios independientemente de su estatus de inmigración, su capacidad de pago o si tiene o no un seguro. Algunos estados requieren que los hospitales les pregunten a los pacientes sobre su estatus de inmigración. Si le preguntan por su estatus de inmigración, usted no está obligado a suministrarlo, y un profesional médico no puede negarse a tratarlo porque usted no quiso divulgar información sobre su estatus de inmigración.

# kyr_healthcare_two_title
source: You should not be refused health care because you don't have identification.
es: No deberían negarle atención médica porque no tiene un documento de identidad.

# kyr_healthcare_two_content
source: Hospitals and health care providers may ask for photo identification, but not for purposes of immigration enforcement. Health care providers ask for identification to make sure that the person getting care is the same person whose name is on the medical record or prescription. You should not be refused health care because you do not have a photo ID.
es: Los hospitales y profesionales médicos pueden pedirle un documento de identidad con foto, pero no a los fines de hacer cumplir las leyes de inmigración. Los profesionales médicos pueden pedirle un documento de identidad para verificar que la persona a quien están atendiendo es la misma que aparece en sus registros médicos o recetas. No deberían negarle atención médica porque no tiene un documento de identidad con foto.

# kyr_healthcare_three_title
source: If you apply for health insurance for yourself or a family member, your information may be used only for health insurance purposes.
es: Si solicita atención médica para usted o un miembro de su familia, su información solo se puede usar a los fines del seguro de salud.

# kyr_healthcare_three_content
source: Federal privacy rules protect families applying for health insurance, including families whose members have different immigration statuses. The information you provide to apply for Medicaid, CHIP, or an ACA Marketplace plan may be used only for the operation of that program—not for immigration enforcement purposes. Government workers, enrollment assisters, and people who help with insurance applications are required by law to keep your information private and secure.
es: Las reglas de privacidad federal protegen a las familias que solicitan un seguro médico, incluyendo aquellas cuyos miembros tienen distintos estatus de inmigración. La información que usted proporciona cuando solicita Medicaid, CHIP o un plan de los Mercados de la ACA solo se puede usar para el funcionamiento de ese programa, no con fines de hacer cumplir las leyes inmigratorias. Los empleados gubernamentales, asistentes de inscripción y personas que ayudan con las solicitudes de seguro están obligados por ley a mantener su información privada y segura.

# kyr_healthcare_four_title
source: You do not have to provide your immigration status if you are applying for insurance for someone else, such as your child.
es: No tiene que proporcionar su estatus de inmigración si está solicitando un seguro para otro familiar, como su hijo.

# kyr_healthcare_four_content
source: By law, applications for Medicaid, CHIP, and Marketplace plans can require your citizenship or immigration status information only if you are applying for coverage for yourself. The applications may not ask for your citizenship or immigration status information if you are applying to enroll another person, like your child, and are not applying for yourself. If you are asked about your immigration status but you are applying for coverage for someone else you can say, “I am not applying for health insurance for myself.”
es: Por ley, las solicitudes de Medicaid, CHIP y planes de los Mercados de la ACA pueden requerir su estatus de ciudadanía o inmigración solo si está solicitando cobertura para usted. Las solicitudes no pueden pedirle información sobre su estatus de ciudadanía o inmigración si las está presentado para inscribir a otra persona, como su hijo, y no para inscribirse a usted mismo. Si le preguntan sobre su estatus de inmigración, pero está solicitando cobertura para otra persona, puede decir, “No estoy solicitado un seguro médico para mí”.

# kyr_healthcare_five_title
source: You don't have to provide a Social Security number (SSN) if you don't have one.
es: No tiene que proporcionar un número del Seguro Social (SSN) si no lo tiene.

# kyr_healthcare_five_content
source: Whether you are applying for health insurance for yourself or on behalf of another person, your health insurance application may not be delayed or denied because you don't have an SSN. Only people who have a valid SSN issued by the Social Security Administration are required to provide one.
es: Ya sea que esté solicitando un seguro médico para usted o en nombre de otra persona, no pueden demorar o rechazar su solicitud de seguro médico porque no tiene un SSN. Solo las personas que tienen un SSN válido emitido por la Administración del Seguro Social están obligadas a proporcionarlo.

# kyr_healthcare_six_title
source: You have a right to receive services in your language when you apply for health insurance and obtain health care.
es: Usted tiene el derecho a recibir servicios en su idioma cuando solicita un seguro médico y obtiene atención médica.

# kyr_healthcare_six_content
source: You have a right to receive language assistance services at no cost when you seek health care at a hospital or community health center or are applying for Medicaid, CHIP, or a Marketplace plan. Hospitals, community health centers and government offices may use bilingual staff, telephone interpretation services, or qualified in-person interpreters to provide language assistance services. Children should not be asked to interpret for their family members, especially in health care settings.
es: Tiene derecho a recibir servicios de asistencia lingüística sin costo cuando pide atención médica en un hospital o centro médico comunitario o está presentando una solicitud para Medicaid, CHIP o un plan de los Mercados de la ACA. Los hospitales, centros médicos comunitarios y oficinas gubernamentales pueden usar personal bilingüe, servicios de interpretación telefónica o intérpretes calificados presenciales para proporcionar servicios de asistencia lingüística. No se les debe pedir a los niños que hagan de intérpretes para los miembros de su familia, sobre todo en establecimientos médicos.

# kyr_healthcare_seven_title
source: You have the following health care options regardless of your immigration status or whether you have health insurance:
es: Usted tiene las siguientes opciones de atención médica, independientemente de su estatus de inmigración o de que tenga o no un seguro:

# kyr_healthcare_seven_content
source: Basic emergency room treatment for serious medical emergencies, including labor and delivery. Health care services from community health centers, migrant health centers, and free clinics. Services from state or local departments of public health (including immunization, screening and treatment for communicable diseases). Programs providing health services necessary to protect life or safety: including emergency medical, food or shelter programs; mental health crisis services; assistance for people experiencing domestic violence; crime victim assistance services and disaster relief. Financial assistance or “charity care” programs at community health centers and most public and safety-net hospitals.
es: tratamiento básico en la sala de emergencia para emergencias médicas serias, incluyendo trabajo de parto y parto; servicios de atención médica en centros médicos comunitarios, centros médicos para migrantes y clínicas gratuitas; servicios de los departamentos de salud pública estatales o locales (como vacunaciones y exámenes de detección y tratamiento de enfermedades contagiosas); programas que ofrecen servicios médicos necesarios para proteger la vida o seguridad, como de atención médica de emergencia, comida o albergue; servicios en caso de crisis de salud mental; ayuda para personas que sufren de violencia en el hogar; servicios de asistencia a víctimas de delitos y asistencia en casos de desastre; ayuda económica o programas de “cuidado compasivo” en centros médicos comunitarios y la mayoría de los hospitales y redes de seguridad públicas.

# kyr_work_nlra_menu
source: Your Rights under the National Labor Relations Act
es: Sus Derechos bajo la Ley Nacional de Relaciones Laborales

# kyr_work_nlra_title
source: Regardless of immigration status, you have the same rights under the National Labor Relations Act (NLRA) as all covered employees including the right to:
es: Independientemente de su estatus migratorio, usted tiene los mismos derechos bajo la Ley Nacional de Relaciones Laborales (NLRA) que todos los empleados cubiertos, incluyendo el derecho a:

# kyr_work_nlra_content
source: Organize with a union to negotiate with your employer concerning your wages, hours, benefits, and other working conditions. Talk about working conditions with your co-workers, the public, or a union. Take action with your co-workers to try to improve your working conditions. Choose not to do any of these actions.
es: Organizarse con un sindicato para negociar con su empleador sobre salarios, horarios, beneficios y otras condiciones laborales. Hablar sobre las condiciones laborales con sus compañeros de trabajo, el público o un sindicato. Tomar medidas con sus compañeros de trabajo para mejorar sus condiciones laborales. Elegir no realizar ninguna de estas acciones.

# kyr_work_nlra_url
source: https://www.nlrb.gov/guidance/key-reference-materials/immigrant-worker-rights
es: https://www.nlrb.gov/es

# kyr_work_emp_menu
source: Employer Cannot Use Your Status Against You
es: El Empleador No Puede Usar su Estatus en su Contra

# kyr_work_emp_title
source: Although employers must obey immigration laws, if you choose to talk to or take action with your co-workers to improve your working conditions, it is illegal for your employer to use your immigration status against you.
es: Aunque los empleadores deben obedecer las leyes de inmigración, si usted elige hablar o tomar medidas con sus compañeros de trabajo para mejorar sus condiciones laborales, es ilegal que su empleador use su estatus migratorio en su contra.
